#元组是python的内置数据结构之一 是不可变序列

'''
可变序列：有增删改操作，且执行完增删改对象地址不发生更改；eg：列表 字典
不可变序列：没有增删改操作；eg：字符串 元组
'''
print('---------------------------元组的创建-----------------------------------')
#方式一 小括号
t=('hello','world','98')
print(t,type(t)) #('hello', 'world', '98') <class 'tuple'>
#方式一引申
t='hello','world','98'
print(t,type(t)) #('hello', 'world', '98') <class 'tuple'>
#元组中只有一个元素，要加逗号
t=('hello')
print(type(t)) #<class 'str'>
t=('hello',)
print(type(t)) #<class 'tuple'>

#方式二 内置函数 tuple()
t=tuple(('hello1','world1','98'))
print(t[1:3])

#空元组创建
t=()
print(t,type(t)) #() <class 'tuple'>
t=tuple() #()
print(t) #()



print('---------------------------为什么要将元组设计为不可变序列-----------------------------------')
t=(10,[20,30],9)
print(t[0],type(t[0]),id(t[0])) #10 <class 'int'> 140705446788448
print(t[1],type(t[1]),id(t[1])) #[20, 30] <class 'list'> 1953718751752
print(t[2],type(t[2]),id(t[2])) #9 <class 'int'> 140705446788416

'''
元组存储的是对象的引用
 如果元组中的对象本身是不可变对象 则不能在引用其他对象
 如果元组中的对象本身是可变对象 则可变对象的引用不允许改变 但可以改变数据
'''

#将t[1]的10改为100 报错 不允许修改 元组不允许修改元素值
#t[1]=100
t[1].append(40)
print(t,id(t[1])) #(10, [20, 30, 40], 9) 增加完后元组的t[1]元素id值不变



print('------------------------------元组的遍历--------------------------------------')
t=('hello','world','98')
#第一种获取元组的方式 使用[]
print(t[0])
print(t[1])
print(t[2])
#print(t[3]) #报错 数据越界

#第二种方式 for循环
for item in t:
    print(item)