print('----------------------------------------模块的创建-----------------------------------------------------')
'''
优点：
一个.py文件就是一个模块
一个模块可以包含n个函数、类、变量等
优点：方便其他程序和脚本的导入并使用、避免函数名和变量名冲突、提高代码可维护性、提高代码可重用性
'''


print('-------------------------------------------模块的导入------------------------------------------------')
'''
导入模块方式：
1、import 模块名称 [as 别名]
2、from 模块名称 import 函数/变量/类
'''
import math
#查看math对象包含的方法
print(dir(math))
print(math.ceil(9.001))     #10
print(math.floor(9.999))    #9
print(math.pow(2,3))        #8.0  2的3次方
print(math.pi)              #3.141592653589793

#导入模块的某个方法
from math import pi
print(pi)

from math import ceil
print(ceil(2.89))



print("-----------------------------------------------自定义模块的导入----------------------------------------")
"""
将要导入.py模块所在的文件夹 右键->将目标设置为->源根
"""
import calc2
print(calc2.add(1, 3)) #4


print('----------------------------------------------以主程序的形式运行-------------------------------------------')
'''
if _name_=='_main_':
每个模块的定义中都包含记录模块名称的变量_name_，程序检查该变量以确认在哪个模块中运行，如果一个模块未被导入到其他程序中执行，那么它可能在解释器的顶级模块中执行，顶级模块的_name_变量值为_main_
'''
import calc2
print(calc2.add(1,5))  #6






